server/app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "time", "budget", "starting_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "dan"], ["time", 123], ["budget", 123], ["starting_at", nil], ["created_at", "2023-05-22 23:26:24.347899"], ["updated_at", "2023-05-22 23:26:24.347899"]]
---
  def create
    @project = Project.new(project_params)

    if @project.save