api-yup/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "d"], ["email", "d@d.com"], ["password", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2023-05-25 04:12:26.922603"], ["updated_at", "2023-05-25 04:12:26.922603"]]
---
  def create
    @user = User.create(user_params)